Revit 2027 API
IFCLegacyStairOrRamp.GetTreadsLength Method
 Gets the length of treads.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<double> GetTreadsLength()
Public Function GetTreadsLength As IList(Of Double)
public:
IList<double>^ GetTreadsLength()
member GetTreadsLength : unit -> IList<float>
Return Value
IList<Double>
 The length of treads.
See Also
Reference
IFCLegacyStairOrRamp Class
Autodesk.Revit.DB.IFC Namespace